{"modelTopology":{"class_name":"Model","config":{"name":"model3","layers":[{"name":"input3","class_name":"InputLayer","config":{"batch_input_shape":[null,13],"dtype":"float32","sparse":false,"name":"input3"},"inbound_nodes":[]},{"name":"input4","class_name":"InputLayer","config":{"batch_input_shape":[null,13,1],"dtype":"float32","sparse":false,"name":"input4"},"inbound_nodes":[]},{"name":"input5","class_name":"InputLayer","config":{"batch_input_shape":[null,13,1],"dtype":"float32","sparse":false,"name":"input5"},"inbound_nodes":[]},{"name":"input6","class_name":"InputLayer","config":{"batch_input_shape":[null,13,1],"dtype":"float32","sparse":false,"name":"input6"},"inbound_nodes":[]},{"name":"sequential_1","class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"Dense","config":{"units":100,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true,"batch_input_shape":[null,13],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.2,"noise_shape":null,"seed":null,"name":"dropout_Dropout1","trainable":true}},{"class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true}},{"class_name":"Dropout","config":{"rate":0.2,"noise_shape":null,"seed":null,"name":"dropout_Dropout2","trainable":true}},{"class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true}}]},"inbound_nodes":[[["input3",0,0,{}]]]},{"name":"sequential_2","class_name":"Sequential","config":{"name":"sequential_2","layers":[{"class_name":"Conv1D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3],"strides":[1],"padding":"valid","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_Conv1D1","trainable":true,"batch_input_shape":[null,13,1],"dtype":"float32"}},{"class_name":"MaxPooling1D","config":{"pool_size":[2],"padding":"valid","strides":[2],"name":"max_pooling1d_MaxPooling1D1","trainable":true}},{"class_name":"Dropout","config":{"rate":0.2,"noise_shape":null,"seed":null,"name":"dropout_Dropout3","trainable":true}},{"class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":true}},{"class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4","trainable":true}},{"class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5","trainable":true}},{"class_name":"Dropout","config":{"rate":0.2,"noise_shape":null,"seed":null,"name":"dropout_Dropout4","trainable":true}}]},"inbound_nodes":[[["input4",0,0,{}]]]},{"name":"model1","class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,13,1],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"lstm_LSTM1","class_name":"LSTM","config":{"name":"lstm_LSTM1","trainable":true,"units":128,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.2,"recurrent_dropout":0,"implementation":null,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"dropout_Dropout5","class_name":"Dropout","config":{"rate":0.2,"noise_shape":null,"seed":null,"name":"dropout_Dropout5","trainable":true},"inbound_nodes":[[["lstm_LSTM1",0,0,{}]]]},{"name":"dense_Dense6","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6","trainable":true},"inbound_nodes":[[["dropout_Dropout5",0,0,{}]]]}],"input_layers":[["input1",0,0]],"output_layers":[["dense_Dense6",0,0]]},"inbound_nodes":[[["input5",0,0,{}]]]},{"name":"model2","class_name":"Model","config":{"name":"model2","layers":[{"name":"input2","class_name":"InputLayer","config":{"batch_input_shape":[null,13,1],"dtype":"float32","sparse":false,"name":"input2"},"inbound_nodes":[]},{"name":"bidirectional_Bidirectional1","class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM2","trainable":true,"units":128,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.2,"recurrent_dropout":0,"implementation":null,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional1","trainable":true},"inbound_nodes":[[["input2",0,0,{}]]]},{"name":"dropout_Dropout6","class_name":"Dropout","config":{"rate":0.2,"noise_shape":null,"seed":null,"name":"dropout_Dropout6","trainable":true},"inbound_nodes":[[["bidirectional_Bidirectional1",0,0,{}]]]},{"name":"dense_Dense7","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7","trainable":true},"inbound_nodes":[[["dropout_Dropout6",0,0,{}]]]}],"input_layers":[["input2",0,0]],"output_layers":[["dense_Dense7",0,0]]},"inbound_nodes":[[["input6",0,0,{}]]]},{"name":"concatenate_Concatenate1","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate1","trainable":true},"inbound_nodes":[[["sequential_1",1,0,{}],["sequential_2",1,0,{}],["model1",1,0,{}],["model2",1,0,{}]]]},{"name":"dense_Dense8","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense8","trainable":true},"inbound_nodes":[[["concatenate_Concatenate1",0,0,{}]]]},{"name":"dense_Dense9","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense9","trainable":true},"inbound_nodes":[[["dense_Dense8",0,0,{}]]]}],"input_layers":[["input3",0,0],["input4",0,0],["input5",0,0],["input6",0,0]],"output_layers":[["dense_Dense9",0,0]]},"keras_version":"tfjs-layers 4.21.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1/kernel","shape":[13,100],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[100],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[100,64],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[64],"dtype":"float32"},{"name":"dense_Dense3/kernel","shape":[64,64],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[64],"dtype":"float32"},{"name":"conv1d_Conv1D1/kernel","shape":[3,1,64],"dtype":"float32"},{"name":"conv1d_Conv1D1/bias","shape":[64],"dtype":"float32"},{"name":"dense_Dense4/kernel","shape":[320,128],"dtype":"float32"},{"name":"dense_Dense4/bias","shape":[128],"dtype":"float32"},{"name":"dense_Dense5/kernel","shape":[128,64],"dtype":"float32"},{"name":"dense_Dense5/bias","shape":[64],"dtype":"float32"},{"name":"lstm_LSTM1/kernel","shape":[1,512],"dtype":"float32"},{"name":"lstm_LSTM1/recurrent_kernel","shape":[128,512],"dtype":"float32"},{"name":"lstm_LSTM1/bias","shape":[512],"dtype":"float32"},{"name":"dense_Dense6/kernel","shape":[128,64],"dtype":"float32"},{"name":"dense_Dense6/bias","shape":[64],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/forward_lstm_LSTM2/kernel","shape":[1,512],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/forward_lstm_LSTM2/recurrent_kernel","shape":[128,512],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/forward_lstm_LSTM2/bias","shape":[512],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/backward_lstm_LSTM2/kernel","shape":[1,512],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/backward_lstm_LSTM2/recurrent_kernel","shape":[128,512],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/backward_lstm_LSTM2/bias","shape":[512],"dtype":"float32"},{"name":"dense_Dense7/kernel","shape":[256,64],"dtype":"float32"},{"name":"dense_Dense7/bias","shape":[64],"dtype":"float32"},{"name":"dense_Dense8/kernel","shape":[256,128],"dtype":"float32"},{"name":"dense_Dense8/bias","shape":[128],"dtype":"float32"},{"name":"dense_Dense9/kernel","shape":[128,1],"dtype":"float32"},{"name":"dense_Dense9/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.21.0","convertedBy":null}